###################################################################

# Created by write_sdc on Thu Mar  5 00:18:04 2015

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell NAND2X1 [get_ports pushin]
set_driving_cell -lib_cell NAND2X1 [get_ports {opin[3]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {opin[2]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {opin[1]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {opin[0]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[31]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[30]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[29]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[28]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[27]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[26]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[25]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[24]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[23]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[22]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[21]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[20]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[19]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[18]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[17]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[16]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[15]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[14]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[13]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[12]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[11]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[10]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[9]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[8]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[7]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[6]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[5]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[4]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[3]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[2]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[1]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {datain[0]}]
create_clock [get_ports clk]  -period 25  -waveform {0 12.5}
set_clock_uncertainty 0.25  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_max_delay 23.5  -to [get_ports pushout]
set_max_delay 23.5  -to [get_ports {dataout[31]}]
set_max_delay 23.5  -to [get_ports {dataout[30]}]
set_max_delay 23.5  -to [get_ports {dataout[29]}]
set_max_delay 23.5  -to [get_ports {dataout[28]}]
set_max_delay 23.5  -to [get_ports {dataout[27]}]
set_max_delay 23.5  -to [get_ports {dataout[26]}]
set_max_delay 23.5  -to [get_ports {dataout[25]}]
set_max_delay 23.5  -to [get_ports {dataout[24]}]
set_max_delay 23.5  -to [get_ports {dataout[23]}]
set_max_delay 23.5  -to [get_ports {dataout[22]}]
set_max_delay 23.5  -to [get_ports {dataout[21]}]
set_max_delay 23.5  -to [get_ports {dataout[20]}]
set_max_delay 23.5  -to [get_ports {dataout[19]}]
set_max_delay 23.5  -to [get_ports {dataout[18]}]
set_max_delay 23.5  -to [get_ports {dataout[17]}]
set_max_delay 23.5  -to [get_ports {dataout[16]}]
set_max_delay 23.5  -to [get_ports {dataout[15]}]
set_max_delay 23.5  -to [get_ports {dataout[14]}]
set_max_delay 23.5  -to [get_ports {dataout[13]}]
set_max_delay 23.5  -to [get_ports {dataout[12]}]
set_max_delay 23.5  -to [get_ports {dataout[11]}]
set_max_delay 23.5  -to [get_ports {dataout[10]}]
set_max_delay 23.5  -to [get_ports {dataout[9]}]
set_max_delay 23.5  -to [get_ports {dataout[8]}]
set_max_delay 23.5  -to [get_ports {dataout[7]}]
set_max_delay 23.5  -to [get_ports {dataout[6]}]
set_max_delay 23.5  -to [get_ports {dataout[5]}]
set_max_delay 23.5  -to [get_ports {dataout[4]}]
set_max_delay 23.5  -to [get_ports {dataout[3]}]
set_max_delay 23.5  -to [get_ports {dataout[2]}]
set_max_delay 23.5  -to [get_ports {dataout[1]}]
set_max_delay 23.5  -to [get_ports {dataout[0]}]
set_max_delay 23.5  -from [list [get_ports pushin] [get_ports {opin[3]}] [get_ports {opin[2]}]    \
[get_ports {opin[1]}] [get_ports {opin[0]}] [get_ports {datain[31]}]           \
[get_ports {datain[30]}] [get_ports {datain[29]}] [get_ports {datain[28]}]     \
[get_ports {datain[27]}] [get_ports {datain[26]}] [get_ports {datain[25]}]     \
[get_ports {datain[24]}] [get_ports {datain[23]}] [get_ports {datain[22]}]     \
[get_ports {datain[21]}] [get_ports {datain[20]}] [get_ports {datain[19]}]     \
[get_ports {datain[18]}] [get_ports {datain[17]}] [get_ports {datain[16]}]     \
[get_ports {datain[15]}] [get_ports {datain[14]}] [get_ports {datain[13]}]     \
[get_ports {datain[12]}] [get_ports {datain[11]}] [get_ports {datain[10]}]     \
[get_ports {datain[9]}] [get_ports {datain[8]}] [get_ports {datain[7]}]        \
[get_ports {datain[6]}] [get_ports {datain[5]}] [get_ports {datain[4]}]        \
[get_ports {datain[3]}] [get_ports {datain[2]}] [get_ports {datain[1]}]        \
[get_ports {datain[0]}]]
set_input_delay -clock clk  0.5  [get_ports pushin]
set_input_delay -clock clk  0.5  [get_ports {opin[3]}]
set_input_delay -clock clk  0.5  [get_ports {opin[2]}]
set_input_delay -clock clk  0.5  [get_ports {opin[1]}]
set_input_delay -clock clk  0.5  [get_ports {opin[0]}]
set_input_delay -clock clk  0.5  [get_ports {datain[31]}]
set_input_delay -clock clk  0.5  [get_ports {datain[30]}]
set_input_delay -clock clk  0.5  [get_ports {datain[29]}]
set_input_delay -clock clk  0.5  [get_ports {datain[28]}]
set_input_delay -clock clk  0.5  [get_ports {datain[27]}]
set_input_delay -clock clk  0.5  [get_ports {datain[26]}]
set_input_delay -clock clk  0.5  [get_ports {datain[25]}]
set_input_delay -clock clk  0.5  [get_ports {datain[24]}]
set_input_delay -clock clk  0.5  [get_ports {datain[23]}]
set_input_delay -clock clk  0.5  [get_ports {datain[22]}]
set_input_delay -clock clk  0.5  [get_ports {datain[21]}]
set_input_delay -clock clk  0.5  [get_ports {datain[20]}]
set_input_delay -clock clk  0.5  [get_ports {datain[19]}]
set_input_delay -clock clk  0.5  [get_ports {datain[18]}]
set_input_delay -clock clk  0.5  [get_ports {datain[17]}]
set_input_delay -clock clk  0.5  [get_ports {datain[16]}]
set_input_delay -clock clk  0.5  [get_ports {datain[15]}]
set_input_delay -clock clk  0.5  [get_ports {datain[14]}]
set_input_delay -clock clk  0.5  [get_ports {datain[13]}]
set_input_delay -clock clk  0.5  [get_ports {datain[12]}]
set_input_delay -clock clk  0.5  [get_ports {datain[11]}]
set_input_delay -clock clk  0.5  [get_ports {datain[10]}]
set_input_delay -clock clk  0.5  [get_ports {datain[9]}]
set_input_delay -clock clk  0.5  [get_ports {datain[8]}]
set_input_delay -clock clk  0.5  [get_ports {datain[7]}]
set_input_delay -clock clk  0.5  [get_ports {datain[6]}]
set_input_delay -clock clk  0.5  [get_ports {datain[5]}]
set_input_delay -clock clk  0.5  [get_ports {datain[4]}]
set_input_delay -clock clk  0.5  [get_ports {datain[3]}]
set_input_delay -clock clk  0.5  [get_ports {datain[2]}]
set_input_delay -clock clk  0.5  [get_ports {datain[1]}]
set_input_delay -clock clk  0.5  [get_ports {datain[0]}]
set_output_delay -clock clk  0.5  [get_ports pushout]
set_output_delay -clock clk  0.5  [get_ports {dataout[31]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[30]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[29]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[28]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[27]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[26]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[25]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[24]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[23]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[22]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[21]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[20]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[19]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[18]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[17]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[16]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[15]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[14]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[13]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[12]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[11]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[10]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[9]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[8]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[7]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[6]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[5]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[4]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[3]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[2]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[1]}]
set_output_delay -clock clk  0.5  [get_ports {dataout[0]}]
