###############################################################
#  Generated by:      Cadence Encounter 09.14-s273_1
#  OS:                Linux x86_64(Host ID eecad15.engr.sjsu.edu)
#  Generated on:      Thu Mar  5 15:41:15 2015
#  Command:           saveDesign poly5.enc
###############################################################
set sdc_version 1.4
current_design poly5
create_clock [get_ports {clk}]  -name clk -period 25 -waveform {0 12.5}
set_propagated_clock  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {opin[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {opin[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {opin[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {opin[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {opin[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {opin[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {opin[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {opin[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {opin[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {opin[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {opin[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {opin[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {opin[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {opin[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {opin[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {opin[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[31]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[31]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[31]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[31]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[30]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[30]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[30]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[30]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[29]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[29]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[29]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[29]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[28]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[28]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[28]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[28]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[27]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[27]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[27]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[27]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[26]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[26]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[26]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[26]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[25]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[25]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[25]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[25]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[24]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[24]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[24]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[24]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[23]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[23]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[23]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[23]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[22]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[22]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[22]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[22]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[21]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[21]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[21]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[21]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[20]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[20]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[20]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[20]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[19]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[19]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[19]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[19]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[18]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[18]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[18]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[18]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[17]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[17]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[17]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[17]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[16]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[16]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[16]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[16]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[15]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[15]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[15]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[15]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[14]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[14]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[14]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[14]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[13]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[13]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[13]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[13]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[12]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[12]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[12]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[12]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[11]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[11]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[11]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[11]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[10]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[10]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[10]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[10]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[9]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[9]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[9]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[9]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[8]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[8]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[8]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[8]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[7]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[7]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[7]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[7]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[6]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[6]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[6]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[6]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[5]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[5]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[5]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[5]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[4]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[4]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[4]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[4]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {datain[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {datain[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {datain[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {datain[0]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[12]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[10]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {opin[2]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {opin[0]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[8]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[28]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[6]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[19]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[26]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[4]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[17]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[24]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[31]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {pushin}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[2]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[15]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[22]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[0]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[13]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[20]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[11]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {opin[3]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {opin[1]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[9]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[29]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[7]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[27]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[5]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[18]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[25]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[3]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[16]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[23]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[30]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[1]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[14]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {datain[21]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[28]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[19]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[26]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[17]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[24]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[31]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {pushout}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[15]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[22]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[13]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[20]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[11]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[9]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[7]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[5]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[29]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[27]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[18]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[25]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[16]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[23]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[30]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[14]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[21]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[12]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[10]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[8]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[6]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {dataout[4]}]
set_clock_uncertainty 0.25 [get_clocks {clk}]
set_max_delay 23.5  -to [get_ports {dataout[0] dataout[1] dataout[2] dataout[3] dataout[4] dataout[5] dataout[6] dataout[7] dataout[8] dataout[9] dataout[10] dataout[11] dataout[12] dataout[13] dataout[14] dataout[15] dataout[16] dataout[17] dataout[18] dataout[19] dataout[20] dataout[21] dataout[22] dataout[23] dataout[24] dataout[25] dataout[26] dataout[27] dataout[28] dataout[29] dataout[30] dataout[31] pushout}] 
set_max_delay 23.5  -from [get_ports {datain[0] datain[1] datain[2] datain[3] datain[4] datain[5] datain[6] datain[7] datain[8] datain[9] datain[10] datain[11] datain[12] datain[13] datain[14] datain[15] datain[16] datain[17] datain[18] datain[19] datain[20] datain[21] datain[22] datain[23] datain[24] datain[25] datain[26] datain[27] datain[28] datain[29] datain[30] datain[31] opin[0] opin[1] opin[2] opin[3] pushin}] 
