###############################################################
#  Generated by:      Cadence Encounter 09.14-s273_1
#  OS:                Linux x86_64(Host ID eecad43.engr.sjsu.edu)
#  Generated on:      Thu Mar  5 20:49:55 2015
#  Command:           saveDesign sfilt.enc
###############################################################
set sdc_version 1.4
current_design sfilt
create_clock [get_ports {clk}]  -name clk -period 3.3 -waveform {0 1.65}
set_propagated_clock  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {pushin}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {cmd[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {cmd[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {cmd[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {cmd[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {cmd[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {cmd[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {cmd[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {cmd[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[31]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[31]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[31]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[31]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[30]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[30]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[30]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[30]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[29]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[29]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[29]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[29]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[28]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[28]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[28]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[28]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[27]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[27]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[27]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[27]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[26]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[26]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[26]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[26]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[25]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[25]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[25]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[25]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[24]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[24]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[24]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[24]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[23]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[23]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[23]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[23]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[22]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[22]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[22]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[22]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[21]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[21]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[21]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[21]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[20]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[20]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[20]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[20]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[19]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[19]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[19]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[19]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[18]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[18]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[18]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[18]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[17]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[17]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[17]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[17]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[16]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[16]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[16]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[16]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[15]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[15]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[15]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[15]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[14]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[14]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[14]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[14]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[13]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[13]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[13]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[13]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[12]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[12]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[12]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[12]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[11]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[11]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[11]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[11]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[10]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[10]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[10]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[10]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[9]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[9]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[9]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[9]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[8]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[8]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[8]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[8]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[7]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[7]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[7]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[7]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[6]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[6]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[6]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[6]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[5]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[5]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[5]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[5]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[4]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[4]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[4]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[4]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {q[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {q[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {q[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {q[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[31]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[31]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[31]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[31]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[30]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[30]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[30]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[30]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[29]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[29]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[29]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[29]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[28]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[28]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[28]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[28]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[27]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[27]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[27]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[27]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[26]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[26]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[26]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[26]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[25]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[25]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[25]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[25]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[24]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[24]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[24]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[24]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[23]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[23]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[23]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[23]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[22]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[22]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[22]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[22]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[21]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[21]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[21]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[21]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[20]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[20]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[20]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[20]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[19]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[19]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[19]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[19]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[18]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[18]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[18]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[18]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[17]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[17]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[17]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[17]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[16]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[16]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[16]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[16]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[15]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[15]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[15]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[15]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[14]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[14]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[14]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[14]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[13]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[13]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[13]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[13]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[12]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[12]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[12]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[12]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[11]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[11]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[11]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[11]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[10]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[10]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[10]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[10]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[9]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[9]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[9]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[9]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[8]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[8]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[8]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[8]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[7]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[7]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[7]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[7]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[6]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[6]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[6]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[6]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[5]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[5]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[5]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[5]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[4]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[4]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[4]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[4]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[3]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[3]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[2]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[2]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[1]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[1]}]
set_driving_cell -lib_cell NAND2X1 -rise -min [get_ports {h[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -min [get_ports {h[0]}]
set_driving_cell -lib_cell NAND2X1 -rise -max [get_ports {h[0]}]
set_driving_cell -lib_cell NAND2X1 -fall -max [get_ports {h[0]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[4]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[10]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[21]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[14]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[1]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[0]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[19]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[26]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[10]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[9]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[15]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[22]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[6]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[26]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[19]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[5]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[11]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[22]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[15]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[2]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[1]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[27]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[11]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[16]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[23]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[27]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[30]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[7]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[6]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[12]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[30]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[23]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[16]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[3]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {cmd[0]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[2]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[28]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[12]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[17]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[24]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[8]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[28]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[31]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[7]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[13]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[20]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[4]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {cmd[1]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[31]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[24]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[17]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[3]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[29]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[20]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[13]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[0]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[18]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[25]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[29]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[9]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[8]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[14]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {h[21]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[25]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[18]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {q[5]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {pushin}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[28]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {pushout}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[19]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[26]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[8]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[17]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[24]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[31]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[6]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[15]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[22]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[4]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[13]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[20]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[11]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[29]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[27]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[9]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[18]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[25]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[7]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[16]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[23]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[30]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[5]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[14]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[21]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[12]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {z[10]}]
set_clock_uncertainty 0.25 [get_clocks {clk}]
set_max_delay 1.8  -to [get_ports {z[0] z[1] z[2] z[3] z[4] z[5] z[6] z[7] z[8] z[9] z[10] z[11] z[12] z[13] z[14] z[15] z[16] z[17] z[18] z[19] z[20] z[21] z[22] z[23] z[24] z[25] z[26] z[27] z[28] z[29] z[30] z[31] pushout}] 
set_max_delay 1.8  -from [get_ports {h[0] h[1] h[2] h[3] h[4] h[5] h[6] h[7] h[8] h[9] h[10] h[11] h[12] h[13] h[14] h[15] h[16] h[17] h[18] h[19] h[20] h[21] h[22] h[23] h[24] h[25] h[26] h[27] h[28] h[29] h[30] h[31] q[0] q[1] q[2] q[3] q[4] q[5] q[6] q[7] q[8] q[9] q[10] q[11] q[12] q[13] q[14] q[15] q[16] q[17] q[18] q[19] q[20] q[21] q[22] q[23] q[24] q[25] q[26] q[27] q[28] q[29] q[30] q[31] cmd[0] cmd[1] pushin}] 
