###################################################################

# Created by write_sdc on Sat Mar  7 18:09:10 2015

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell NAND2X1 [get_ports pushin]
set_driving_cell -lib_cell NAND2X1 [get_ports {cmd[1]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {cmd[0]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[31]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[30]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[29]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[28]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[27]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[26]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[25]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[24]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[23]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[22]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[21]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[20]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[19]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[18]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[17]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[16]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[15]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[14]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[13]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[12]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[11]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[10]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[9]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[8]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[7]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[6]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[5]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[4]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[3]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[2]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[1]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {q[0]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[31]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[30]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[29]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[28]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[27]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[26]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[25]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[24]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[23]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[22]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[21]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[20]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[19]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[18]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[17]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[16]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[15]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[14]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[13]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[12]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[11]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[10]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[9]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[8]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[7]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[6]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[5]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[4]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[3]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[2]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[1]}]
set_driving_cell -lib_cell NAND2X1 [get_ports {h[0]}]
create_clock [get_ports clk]  -period 3.3  -waveform {0 1.65}
set_clock_uncertainty 0.25  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_max_delay 1.8  -to [get_ports pushout]
set_max_delay 1.8  -to [get_ports {z[31]}]
set_max_delay 1.8  -to [get_ports {z[30]}]
set_max_delay 1.8  -to [get_ports {z[29]}]
set_max_delay 1.8  -to [get_ports {z[28]}]
set_max_delay 1.8  -to [get_ports {z[27]}]
set_max_delay 1.8  -to [get_ports {z[26]}]
set_max_delay 1.8  -to [get_ports {z[25]}]
set_max_delay 1.8  -to [get_ports {z[24]}]
set_max_delay 1.8  -to [get_ports {z[23]}]
set_max_delay 1.8  -to [get_ports {z[22]}]
set_max_delay 1.8  -to [get_ports {z[21]}]
set_max_delay 1.8  -to [get_ports {z[20]}]
set_max_delay 1.8  -to [get_ports {z[19]}]
set_max_delay 1.8  -to [get_ports {z[18]}]
set_max_delay 1.8  -to [get_ports {z[17]}]
set_max_delay 1.8  -to [get_ports {z[16]}]
set_max_delay 1.8  -to [get_ports {z[15]}]
set_max_delay 1.8  -to [get_ports {z[14]}]
set_max_delay 1.8  -to [get_ports {z[13]}]
set_max_delay 1.8  -to [get_ports {z[12]}]
set_max_delay 1.8  -to [get_ports {z[11]}]
set_max_delay 1.8  -to [get_ports {z[10]}]
set_max_delay 1.8  -to [get_ports {z[9]}]
set_max_delay 1.8  -to [get_ports {z[8]}]
set_max_delay 1.8  -to [get_ports {z[7]}]
set_max_delay 1.8  -to [get_ports {z[6]}]
set_max_delay 1.8  -to [get_ports {z[5]}]
set_max_delay 1.8  -to [get_ports {z[4]}]
set_max_delay 1.8  -to [get_ports {z[3]}]
set_max_delay 1.8  -to [get_ports {z[2]}]
set_max_delay 1.8  -to [get_ports {z[1]}]
set_max_delay 1.8  -to [get_ports {z[0]}]
set_max_delay 1.8  -from [list [get_ports pushin] [get_ports {cmd[1]}] [get_ports {cmd[0]}]      \
[get_ports {q[31]}] [get_ports {q[30]}] [get_ports {q[29]}] [get_ports         \
{q[28]}] [get_ports {q[27]}] [get_ports {q[26]}] [get_ports {q[25]}]           \
[get_ports {q[24]}] [get_ports {q[23]}] [get_ports {q[22]}] [get_ports         \
{q[21]}] [get_ports {q[20]}] [get_ports {q[19]}] [get_ports {q[18]}]           \
[get_ports {q[17]}] [get_ports {q[16]}] [get_ports {q[15]}] [get_ports         \
{q[14]}] [get_ports {q[13]}] [get_ports {q[12]}] [get_ports {q[11]}]           \
[get_ports {q[10]}] [get_ports {q[9]}] [get_ports {q[8]}] [get_ports {q[7]}]   \
[get_ports {q[6]}] [get_ports {q[5]}] [get_ports {q[4]}] [get_ports {q[3]}]    \
[get_ports {q[2]}] [get_ports {q[1]}] [get_ports {q[0]}] [get_ports {h[31]}]   \
[get_ports {h[30]}] [get_ports {h[29]}] [get_ports {h[28]}] [get_ports         \
{h[27]}] [get_ports {h[26]}] [get_ports {h[25]}] [get_ports {h[24]}]           \
[get_ports {h[23]}] [get_ports {h[22]}] [get_ports {h[21]}] [get_ports         \
{h[20]}] [get_ports {h[19]}] [get_ports {h[18]}] [get_ports {h[17]}]           \
[get_ports {h[16]}] [get_ports {h[15]}] [get_ports {h[14]}] [get_ports         \
{h[13]}] [get_ports {h[12]}] [get_ports {h[11]}] [get_ports {h[10]}]           \
[get_ports {h[9]}] [get_ports {h[8]}] [get_ports {h[7]}] [get_ports {h[6]}]    \
[get_ports {h[5]}] [get_ports {h[4]}] [get_ports {h[3]}] [get_ports {h[2]}]    \
[get_ports {h[1]}] [get_ports {h[0]}]]
set_input_delay -clock clk  0.5  [get_ports pushin]
set_input_delay -clock clk  0.5  [get_ports {cmd[1]}]
set_input_delay -clock clk  0.5  [get_ports {cmd[0]}]
set_input_delay -clock clk  0.5  [get_ports {q[31]}]
set_input_delay -clock clk  0.5  [get_ports {q[30]}]
set_input_delay -clock clk  0.5  [get_ports {q[29]}]
set_input_delay -clock clk  0.5  [get_ports {q[28]}]
set_input_delay -clock clk  0.5  [get_ports {q[27]}]
set_input_delay -clock clk  0.5  [get_ports {q[26]}]
set_input_delay -clock clk  0.5  [get_ports {q[25]}]
set_input_delay -clock clk  0.5  [get_ports {q[24]}]
set_input_delay -clock clk  0.5  [get_ports {q[23]}]
set_input_delay -clock clk  0.5  [get_ports {q[22]}]
set_input_delay -clock clk  0.5  [get_ports {q[21]}]
set_input_delay -clock clk  0.5  [get_ports {q[20]}]
set_input_delay -clock clk  0.5  [get_ports {q[19]}]
set_input_delay -clock clk  0.5  [get_ports {q[18]}]
set_input_delay -clock clk  0.5  [get_ports {q[17]}]
set_input_delay -clock clk  0.5  [get_ports {q[16]}]
set_input_delay -clock clk  0.5  [get_ports {q[15]}]
set_input_delay -clock clk  0.5  [get_ports {q[14]}]
set_input_delay -clock clk  0.5  [get_ports {q[13]}]
set_input_delay -clock clk  0.5  [get_ports {q[12]}]
set_input_delay -clock clk  0.5  [get_ports {q[11]}]
set_input_delay -clock clk  0.5  [get_ports {q[10]}]
set_input_delay -clock clk  0.5  [get_ports {q[9]}]
set_input_delay -clock clk  0.5  [get_ports {q[8]}]
set_input_delay -clock clk  0.5  [get_ports {q[7]}]
set_input_delay -clock clk  0.5  [get_ports {q[6]}]
set_input_delay -clock clk  0.5  [get_ports {q[5]}]
set_input_delay -clock clk  0.5  [get_ports {q[4]}]
set_input_delay -clock clk  0.5  [get_ports {q[3]}]
set_input_delay -clock clk  0.5  [get_ports {q[2]}]
set_input_delay -clock clk  0.5  [get_ports {q[1]}]
set_input_delay -clock clk  0.5  [get_ports {q[0]}]
set_input_delay -clock clk  0.5  [get_ports {h[31]}]
set_input_delay -clock clk  0.5  [get_ports {h[30]}]
set_input_delay -clock clk  0.5  [get_ports {h[29]}]
set_input_delay -clock clk  0.5  [get_ports {h[28]}]
set_input_delay -clock clk  0.5  [get_ports {h[27]}]
set_input_delay -clock clk  0.5  [get_ports {h[26]}]
set_input_delay -clock clk  0.5  [get_ports {h[25]}]
set_input_delay -clock clk  0.5  [get_ports {h[24]}]
set_input_delay -clock clk  0.5  [get_ports {h[23]}]
set_input_delay -clock clk  0.5  [get_ports {h[22]}]
set_input_delay -clock clk  0.5  [get_ports {h[21]}]
set_input_delay -clock clk  0.5  [get_ports {h[20]}]
set_input_delay -clock clk  0.5  [get_ports {h[19]}]
set_input_delay -clock clk  0.5  [get_ports {h[18]}]
set_input_delay -clock clk  0.5  [get_ports {h[17]}]
set_input_delay -clock clk  0.5  [get_ports {h[16]}]
set_input_delay -clock clk  0.5  [get_ports {h[15]}]
set_input_delay -clock clk  0.5  [get_ports {h[14]}]
set_input_delay -clock clk  0.5  [get_ports {h[13]}]
set_input_delay -clock clk  0.5  [get_ports {h[12]}]
set_input_delay -clock clk  0.5  [get_ports {h[11]}]
set_input_delay -clock clk  0.5  [get_ports {h[10]}]
set_input_delay -clock clk  0.5  [get_ports {h[9]}]
set_input_delay -clock clk  0.5  [get_ports {h[8]}]
set_input_delay -clock clk  0.5  [get_ports {h[7]}]
set_input_delay -clock clk  0.5  [get_ports {h[6]}]
set_input_delay -clock clk  0.5  [get_ports {h[5]}]
set_input_delay -clock clk  0.5  [get_ports {h[4]}]
set_input_delay -clock clk  0.5  [get_ports {h[3]}]
set_input_delay -clock clk  0.5  [get_ports {h[2]}]
set_input_delay -clock clk  0.5  [get_ports {h[1]}]
set_input_delay -clock clk  0.5  [get_ports {h[0]}]
set_output_delay -clock clk  0.5  [get_ports pushout]
set_output_delay -clock clk  0.5  [get_ports {z[31]}]
set_output_delay -clock clk  0.5  [get_ports {z[30]}]
set_output_delay -clock clk  0.5  [get_ports {z[29]}]
set_output_delay -clock clk  0.5  [get_ports {z[28]}]
set_output_delay -clock clk  0.5  [get_ports {z[27]}]
set_output_delay -clock clk  0.5  [get_ports {z[26]}]
set_output_delay -clock clk  0.5  [get_ports {z[25]}]
set_output_delay -clock clk  0.5  [get_ports {z[24]}]
set_output_delay -clock clk  0.5  [get_ports {z[23]}]
set_output_delay -clock clk  0.5  [get_ports {z[22]}]
set_output_delay -clock clk  0.5  [get_ports {z[21]}]
set_output_delay -clock clk  0.5  [get_ports {z[20]}]
set_output_delay -clock clk  0.5  [get_ports {z[19]}]
set_output_delay -clock clk  0.5  [get_ports {z[18]}]
set_output_delay -clock clk  0.5  [get_ports {z[17]}]
set_output_delay -clock clk  0.5  [get_ports {z[16]}]
set_output_delay -clock clk  0.5  [get_ports {z[15]}]
set_output_delay -clock clk  0.5  [get_ports {z[14]}]
set_output_delay -clock clk  0.5  [get_ports {z[13]}]
set_output_delay -clock clk  0.5  [get_ports {z[12]}]
set_output_delay -clock clk  0.5  [get_ports {z[11]}]
set_output_delay -clock clk  0.5  [get_ports {z[10]}]
set_output_delay -clock clk  0.5  [get_ports {z[9]}]
set_output_delay -clock clk  0.5  [get_ports {z[8]}]
set_output_delay -clock clk  0.5  [get_ports {z[7]}]
set_output_delay -clock clk  0.5  [get_ports {z[6]}]
set_output_delay -clock clk  0.5  [get_ports {z[5]}]
set_output_delay -clock clk  0.5  [get_ports {z[4]}]
set_output_delay -clock clk  0.5  [get_ports {z[3]}]
set_output_delay -clock clk  0.5  [get_ports {z[2]}]
set_output_delay -clock clk  0.5  [get_ports {z[1]}]
set_output_delay -clock clk  0.5  [get_ports {z[0]}]
